grevaillot/svd_tools/headers/STM32F105xx/usb_otg_host.h
/** USB_OTG_HOST_FS_HCINTMSK3_DTERRM Data toggle error mask **/
#define USB_OTG_HOST_FS_HCINTMSK3_DTERRM		(1 << 10)
/** USB_OTG_HOST_FS_HCINTMSK3_FRMORM Frame overrun mask **/
#define USB_OTG_HOST_FS_HCINTMSK3_FRMORM		(1 << 9)
/** USB_OTG_HOST_FS_HCINTMSK3_BBERRM Babble error mask **/
#define USB_OTG_HOST_FS_HCINTMSK3_BBERRM		(1 << 8)
/** USB_OTG_HOST_FS_HCINTMSK3_TXERRM Transaction error mask **/
#define USB_OTG_HOST_FS_HCINTMSK3_TXERRM		(1 << 7)
/** USB_OTG_HOST_FS_HCINTMSK3_NYET response received interrupt mask **/
#define USB_OTG_HOST_FS_HCINTMSK3_NYET		(1 << 6)
/** USB_OTG_HOST_FS_HCINTMSK3_ACKM ACK response received/transmitted interrupt mask **/
#define USB_OTG_HOST_FS_HCINTMSK3_ACKM		(1 << 5)
/** USB_OTG_HOST_FS_HCINTMSK3_NAKM NAK response received interrupt mask **/
#define USB_OTG_HOST_FS_HCINTMSK3_NAKM		(1 << 4)
/** USB_OTG_HOST_FS_HCINTMSK3_STALLM STALL response received interrupt mask **/
#define USB_OTG_HOST_FS_HCINTMSK3_STALLM		(1 << 3)
/** USB_OTG_HOST_FS_HCINTMSK3_CHHM Channel halted mask **/
#define USB_OTG_HOST_FS_HCINTMSK3_CHHM		(1 << 1)
/** USB_OTG_HOST_FS_HCINTMSK3_XFRCM Transfer completed mask **/
#define USB_OTG_HOST_FS_HCINTMSK3_XFRCM		(1 << 0)

/**@}*/

/** @defgroup usb_otg_host_fs_hctsiz3 FSHCTSIZ3 OTG_FS host channel-3 transfer size register
@{*/


#define USB_OTG_HOST_FS_HCTSIZ3_DPID_SHIFT		29
#define USB_OTG_HOST_FS_HCTSIZ3_DPID_MASK		0x03
/** @defgroup usb_otg_host_fs_hctsiz3_dpid DPID Data PID
@{*/
/**@}*/


#define USB_OTG_HOST_FS_HCTSIZ3_PKTCNT_SHIFT		19
#define USB_OTG_HOST_FS_HCTSIZ3_PKTCNT_MASK		0x3ff
/** @defgroup usb_otg_host_fs_hctsiz3_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define USB_OTG_HOST_FS_HCTSIZ3_XFRSIZ_SHIFT		0
#define USB_OTG_HOST_FS_HCTSIZ3_XFRSIZ_MASK		0x7ffff
/** @defgroup usb_otg_host_fs_hctsiz3_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup usb_otg_host_fs_hcchar4 FSHCCHAR4 OTG_FS host channel-4 characteristics register (OTG_FS_HCCHAR4)
@{*/

/** USB_OTG_HOST_FS_HCCHAR4_CHENA Channel enable **/
#define USB_OTG_HOST_FS_HCCHAR4_CHENA		(1 << 31)
/** USB_OTG_HOST_FS_HCCHAR4_CHDIS Channel disable **/
#define USB_OTG_HOST_FS_HCCHAR4_CHDIS		(1 << 30)
/** USB_OTG_HOST_FS_HCCHAR4_ODDFRM Odd frame **/
#define USB_OTG_HOST_FS_HCCHAR4_ODDFRM		(1 << 29)

#define USB_OTG_HOST_FS_HCCHAR4_DAD_SHIFT		22
#define USB_OTG_HOST_FS_HCCHAR4_DAD_MASK		0x7f
/** @defgroup usb_otg_host_fs_hcchar4_dad DAD Device address
@{*/
/**@}*/


#define USB_OTG_HOST_FS_HCCHAR4_MCNT_SHIFT		20
#define USB_OTG_HOST_FS_HCCHAR4_MCNT_MASK		0x03
/** @defgroup usb_otg_host_fs_hcchar4_mcnt MCNT Multicount
@{*/
/**@}*/


#define USB_OTG_HOST_FS_HCCHAR4_EPTYP_SHIFT		18
#define USB_OTG_HOST_FS_HCCHAR4_EPTYP_MASK		0x03
/** @defgroup usb_otg_host_fs_hcchar4_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** USB_OTG_HOST_FS_HCCHAR4_LSDEV Low-speed device **/
#define USB_OTG_HOST_FS_HCCHAR4_LSDEV		(1 << 17)
/** USB_OTG_HOST_FS_HCCHAR4_EPDIR Endpoint direction **/
#define USB_OTG_HOST_FS_HCCHAR4_EPDIR		(1 << 15)

#define USB_OTG_HOST_FS_HCCHAR4_EPNUM_SHIFT		11
#define USB_OTG_HOST_FS_HCCHAR4_EPNUM_MASK		0x0f
/** @defgroup usb_otg_host_fs_hcchar4_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define USB_OTG_HOST_FS_HCCHAR4_MPSIZ_SHIFT		0
#define USB_OTG_HOST_FS_HCCHAR4_MPSIZ_MASK		0x7ff
/** @defgroup usb_otg_host_fs_hcchar4_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup usb_otg_host_fs_hcint4 FSHCINT4 OTG_FS host channel-4 interrupt register (OTG_FS_HCINT4)
@{*/

/** USB_OTG_HOST_FS_HCINT4_DTERR Data toggle error **/
#define USB_OTG_HOST_FS_HCINT4_DTERR		(1 << 10)
/** USB_OTG_HOST_FS_HCINT4_FRMOR Frame overrun **/
#define USB_OTG_HOST_FS_HCINT4_FRMOR		(1 << 9)
/** USB_OTG_HOST_FS_HCINT4_BBERR Babble error **/
#define USB_OTG_HOST_FS_HCINT4_BBERR		(1 << 8)
/** USB_OTG_HOST_FS_HCINT4_TXERR Transaction error **/
#define USB_OTG_HOST_FS_HCINT4_TXERR		(1 << 7)
/** USB_OTG_HOST_FS_HCINT4_ACK ACK response received/transmitted interrupt **/
#define USB_OTG_HOST_FS_HCINT4_ACK		(1 << 5)
/** USB_OTG_HOST_FS_HCINT4_NAK NAK response received interrupt **/
#define USB_OTG_HOST_FS_HCINT4_NAK		(1 << 4)
/** USB_OTG_HOST_FS_HCINT4_STALL STALL response received interrupt **/
#define USB_OTG_HOST_FS_HCINT4_STALL		(1 << 3)
/** USB_OTG_HOST_FS_HCINT4_CHH Channel halted **/
#define USB_OTG_HOST_FS_HCINT4_CHH		(1 << 1)
/** USB_OTG_HOST_FS_HCINT4_XFRC Transfer completed **/
#define USB_OTG_HOST_FS_HCINT4_XFRC		(1 << 0)

/**@}*/

/** @defgroup usb_otg_host_fs_hcintmsk4 FSHCINTMSK4 OTG_FS host channel-4 mask register (OTG_FS_HCINTMSK4)
@{*/

/** USB_OTG_HOST_FS_HCINTMSK4_DTERRM Data toggle error mask **/
#define USB_OTG_HOST_FS_HCINTMSK4_DTERRM		(1 << 10)
/** USB_OTG_HOST_FS_HCINTMSK4_FRMORM Frame overrun mask **/
#define USB_OTG_HOST_FS_HCINTMSK4_FRMORM		(1 << 9)
/** USB_OTG_HOST_FS_HCINTMSK4_BBERRM Babble error mask **/
#define USB_OTG_HOST_FS_HCINTMSK4_BBERRM		(1 << 8)
/** USB_OTG_HOST_FS_HCINTMSK4_TXERRM Transaction error mask **/
#define USB_OTG_HOST_FS_HCINTMSK4_TXERRM		(1 << 7)
/** USB_OTG_HOST_FS_HCINTMSK4_NYET response received interrupt mask **/
#define USB_OTG_HOST_FS_HCINTMSK4_NYET		(1 << 6)
/** USB_OTG_HOST_FS_HCINTMSK4_ACKM ACK response received/transmitted interrupt mask **/
#define USB_OTG_HOST_FS_HCINTMSK4_ACKM		(1 << 5)
/** USB_OTG_HOST_FS_HCINTMSK4_NAKM NAK response received interrupt mask **/
#define USB_OTG_HOST_FS_HCINTMSK4_NAKM		(1 << 4)
/** USB_OTG_HOST_FS_HCINTMSK4_STALLM STALL response received interrupt mask **/
#define USB_OTG_HOST_FS_HCINTMSK4_STALLM		(1 << 3)
/** USB_OTG_HOST_FS_HCINTMSK4_CHHM Channel halted mask **/
#define USB_OTG_HOST_FS_HCINTMSK4_CHHM		(1 << 1)
/** USB_OTG_HOST_FS_HCINTMSK4_XFRCM Transfer completed mask **/
#define USB_OTG_HOST_FS_HCINTMSK4_XFRCM		(1 << 0)

/**@}*/

/** @defgroup usb_otg_host_fs_hctsiz4 FSHCTSIZ4 OTG_FS host channel-x transfer size register
@{*/


#define USB_OTG_HOST_FS_HCTSIZ4_DPID_SHIFT		29
#define USB_OTG_HOST_FS_HCTSIZ4_DPID_MASK		0x03
/** @defgroup usb_otg_host_fs_hctsiz4_dpid DPID Data PID
@{*/
/**@}*/


#define USB_OTG_HOST_FS_HCTSIZ4_PKTCNT_SHIFT		19
#define USB_OTG_HOST_FS_HCTSIZ4_PKTCNT_MASK		0x3ff
/** @defgroup usb_otg_host_fs_hctsiz4_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define USB_OTG_HOST_FS_HCTSIZ4_XFRSIZ_SHIFT		0
#define USB_OTG_HOST_FS_HCTSIZ4_XFRSIZ_MASK		0x7ffff
/** @defgroup usb_otg_host_fs_hctsiz4_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup usb_otg_host_fs_hcchar5 FSHCCHAR5 OTG_FS host channel-5 characteristics register (OTG_FS_HCCHAR5)
@{*/

