grevaillot/svd_tools/headers/STM32F105xx/usb_otg_host.h
/** USB_OTG_HOST_FS_HCCHAR5_CHENA Channel enable **/
#define USB_OTG_HOST_FS_HCCHAR5_CHENA		(1 << 31)
/** USB_OTG_HOST_FS_HCCHAR5_CHDIS Channel disable **/
#define USB_OTG_HOST_FS_HCCHAR5_CHDIS		(1 << 30)
/** USB_OTG_HOST_FS_HCCHAR5_ODDFRM Odd frame **/
#define USB_OTG_HOST_FS_HCCHAR5_ODDFRM		(1 << 29)

#define USB_OTG_HOST_FS_HCCHAR5_DAD_SHIFT		22
#define USB_OTG_HOST_FS_HCCHAR5_DAD_MASK		0x7f
/** @defgroup usb_otg_host_fs_hcchar5_dad DAD Device address
@{*/
/**@}*/


#define USB_OTG_HOST_FS_HCCHAR5_MCNT_SHIFT		20
#define USB_OTG_HOST_FS_HCCHAR5_MCNT_MASK		0x03
/** @defgroup usb_otg_host_fs_hcchar5_mcnt MCNT Multicount
@{*/
/**@}*/


#define USB_OTG_HOST_FS_HCCHAR5_EPTYP_SHIFT		18
#define USB_OTG_HOST_FS_HCCHAR5_EPTYP_MASK		0x03
/** @defgroup usb_otg_host_fs_hcchar5_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** USB_OTG_HOST_FS_HCCHAR5_LSDEV Low-speed device **/
#define USB_OTG_HOST_FS_HCCHAR5_LSDEV		(1 << 17)
/** USB_OTG_HOST_FS_HCCHAR5_EPDIR Endpoint direction **/
#define USB_OTG_HOST_FS_HCCHAR5_EPDIR		(1 << 15)

#define USB_OTG_HOST_FS_HCCHAR5_EPNUM_SHIFT		11
#define USB_OTG_HOST_FS_HCCHAR5_EPNUM_MASK		0x0f
/** @defgroup usb_otg_host_fs_hcchar5_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define USB_OTG_HOST_FS_HCCHAR5_MPSIZ_SHIFT		0
#define USB_OTG_HOST_FS_HCCHAR5_MPSIZ_MASK		0x7ff
/** @defgroup usb_otg_host_fs_hcchar5_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup usb_otg_host_fs_hcint5 FSHCINT5 OTG_FS host channel-5 interrupt register (OTG_FS_HCINT5)
@{*/

/** USB_OTG_HOST_FS_HCINT5_DTERR Data toggle error **/
#define USB_OTG_HOST_FS_HCINT5_DTERR		(1 << 10)
/** USB_OTG_HOST_FS_HCINT5_FRMOR Frame overrun **/
#define USB_OTG_HOST_FS_HCINT5_FRMOR		(1 << 9)
/** USB_OTG_HOST_FS_HCINT5_BBERR Babble error **/
#define USB_OTG_HOST_FS_HCINT5_BBERR		(1 << 8)
/** USB_OTG_HOST_FS_HCINT5_TXERR Transaction error **/
#define USB_OTG_HOST_FS_HCINT5_TXERR		(1 << 7)
/** USB_OTG_HOST_FS_HCINT5_ACK ACK response received/transmitted interrupt **/
#define USB_OTG_HOST_FS_HCINT5_ACK		(1 << 5)
/** USB_OTG_HOST_FS_HCINT5_NAK NAK response received interrupt **/
#define USB_OTG_HOST_FS_HCINT5_NAK		(1 << 4)
/** USB_OTG_HOST_FS_HCINT5_STALL STALL response received interrupt **/
#define USB_OTG_HOST_FS_HCINT5_STALL		(1 << 3)
/** USB_OTG_HOST_FS_HCINT5_CHH Channel halted **/
#define USB_OTG_HOST_FS_HCINT5_CHH		(1 << 1)
/** USB_OTG_HOST_FS_HCINT5_XFRC Transfer completed **/
#define USB_OTG_HOST_FS_HCINT5_XFRC		(1 << 0)

/**@}*/

/** @defgroup usb_otg_host_fs_hcintmsk5 FSHCINTMSK5 OTG_FS host channel-5 mask register (OTG_FS_HCINTMSK5)
@{*/

/** USB_OTG_HOST_FS_HCINTMSK5_DTERRM Data toggle error mask **/
#define USB_OTG_HOST_FS_HCINTMSK5_DTERRM		(1 << 10)
/** USB_OTG_HOST_FS_HCINTMSK5_FRMORM Frame overrun mask **/
#define USB_OTG_HOST_FS_HCINTMSK5_FRMORM		(1 << 9)
/** USB_OTG_HOST_FS_HCINTMSK5_BBERRM Babble error mask **/
#define USB_OTG_HOST_FS_HCINTMSK5_BBERRM		(1 << 8)
/** USB_OTG_HOST_FS_HCINTMSK5_TXERRM Transaction error mask **/
#define USB_OTG_HOST_FS_HCINTMSK5_TXERRM		(1 << 7)
/** USB_OTG_HOST_FS_HCINTMSK5_NYET response received interrupt mask **/
#define USB_OTG_HOST_FS_HCINTMSK5_NYET		(1 << 6)
/** USB_OTG_HOST_FS_HCINTMSK5_ACKM ACK response received/transmitted interrupt mask **/
#define USB_OTG_HOST_FS_HCINTMSK5_ACKM		(1 << 5)
/** USB_OTG_HOST_FS_HCINTMSK5_NAKM NAK response received interrupt mask **/
#define USB_OTG_HOST_FS_HCINTMSK5_NAKM		(1 << 4)
/** USB_OTG_HOST_FS_HCINTMSK5_STALLM STALL response received interrupt mask **/
#define USB_OTG_HOST_FS_HCINTMSK5_STALLM		(1 << 3)
/** USB_OTG_HOST_FS_HCINTMSK5_CHHM Channel halted mask **/
#define USB_OTG_HOST_FS_HCINTMSK5_CHHM		(1 << 1)
/** USB_OTG_HOST_FS_HCINTMSK5_XFRCM Transfer completed mask **/
#define USB_OTG_HOST_FS_HCINTMSK5_XFRCM		(1 << 0)

/**@}*/

/** @defgroup usb_otg_host_fs_hctsiz5 FSHCTSIZ5 OTG_FS host channel-5 transfer size register
@{*/


#define USB_OTG_HOST_FS_HCTSIZ5_DPID_SHIFT		29
#define USB_OTG_HOST_FS_HCTSIZ5_DPID_MASK		0x03
/** @defgroup usb_otg_host_fs_hctsiz5_dpid DPID Data PID
@{*/
/**@}*/


#define USB_OTG_HOST_FS_HCTSIZ5_PKTCNT_SHIFT		19
#define USB_OTG_HOST_FS_HCTSIZ5_PKTCNT_MASK		0x3ff
/** @defgroup usb_otg_host_fs_hctsiz5_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define USB_OTG_HOST_FS_HCTSIZ5_XFRSIZ_SHIFT		0
#define USB_OTG_HOST_FS_HCTSIZ5_XFRSIZ_MASK		0x7ffff
/** @defgroup usb_otg_host_fs_hctsiz5_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup usb_otg_host_fs_hcchar6 FSHCCHAR6 OTG_FS host channel-6 characteristics register (OTG_FS_HCCHAR6)
@{*/

/** USB_OTG_HOST_FS_HCCHAR6_CHENA Channel enable **/
#define USB_OTG_HOST_FS_HCCHAR6_CHENA		(1 << 31)
/** USB_OTG_HOST_FS_HCCHAR6_CHDIS Channel disable **/
#define USB_OTG_HOST_FS_HCCHAR6_CHDIS		(1 << 30)
/** USB_OTG_HOST_FS_HCCHAR6_ODDFRM Odd frame **/
#define USB_OTG_HOST_FS_HCCHAR6_ODDFRM		(1 << 29)

#define USB_OTG_HOST_FS_HCCHAR6_DAD_SHIFT		22
#define USB_OTG_HOST_FS_HCCHAR6_DAD_MASK		0x7f
/** @defgroup usb_otg_host_fs_hcchar6_dad DAD Device address
@{*/
/**@}*/


#define USB_OTG_HOST_FS_HCCHAR6_MCNT_SHIFT		20
#define USB_OTG_HOST_FS_HCCHAR6_MCNT_MASK		0x03
/** @defgroup usb_otg_host_fs_hcchar6_mcnt MCNT Multicount
@{*/
/**@}*/


#define USB_OTG_HOST_FS_HCCHAR6_EPTYP_SHIFT		18
#define USB_OTG_HOST_FS_HCCHAR6_EPTYP_MASK		0x03
/** @defgroup usb_otg_host_fs_hcchar6_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** USB_OTG_HOST_FS_HCCHAR6_LSDEV Low-speed device **/
#define USB_OTG_HOST_FS_HCCHAR6_LSDEV		(1 << 17)
/** USB_OTG_HOST_FS_HCCHAR6_EPDIR Endpoint direction **/
#define USB_OTG_HOST_FS_HCCHAR6_EPDIR		(1 << 15)

#define USB_OTG_HOST_FS_HCCHAR6_EPNUM_SHIFT		11
#define USB_OTG_HOST_FS_HCCHAR6_EPNUM_MASK		0x0f
/** @defgroup usb_otg_host_fs_hcchar6_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define USB_OTG_HOST_FS_HCCHAR6_MPSIZ_SHIFT		0
#define USB_OTG_HOST_FS_HCCHAR6_MPSIZ_MASK		0x7ff
/** @defgroup usb_otg_host_fs_hcchar6_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup usb_otg_host_fs_hcint6 FSHCINT6 OTG_FS host channel-6 interrupt register (OTG_FS_HCINT6)
@{*/

/** USB_OTG_HOST_FS_HCINT6_DTERR Data toggle error **/
#define USB_OTG_HOST_FS_HCINT6_DTERR		(1 << 10)
/** USB_OTG_HOST_FS_HCINT6_FRMOR Frame overrun **/
#define USB_OTG_HOST_FS_HCINT6_FRMOR		(1 << 9)
/** USB_OTG_HOST_FS_HCINT6_BBERR Babble error **/
#define USB_OTG_HOST_FS_HCINT6_BBERR		(1 << 8)
/** USB_OTG_HOST_FS_HCINT6_TXERR Transaction error **/
#define USB_OTG_HOST_FS_HCINT6_TXERR		(1 << 7)
/** USB_OTG_HOST_FS_HCINT6_ACK ACK response received/transmitted interrupt **/
#define USB_OTG_HOST_FS_HCINT6_ACK		(1 << 5)
/** USB_OTG_HOST_FS_HCINT6_NAK NAK response received interrupt **/
#define USB_OTG_HOST_FS_HCINT6_NAK		(1 << 4)
/** USB_OTG_HOST_FS_HCINT6_STALL STALL response received interrupt **/
#define USB_OTG_HOST_FS_HCINT6_STALL		(1 << 3)
/** USB_OTG_HOST_FS_HCINT6_CHH Channel halted **/
#define USB_OTG_HOST_FS_HCINT6_CHH		(1 << 1)
/** USB_OTG_HOST_FS_HCINT6_XFRC Transfer completed **/
#define USB_OTG_HOST_FS_HCINT6_XFRC		(1 << 0)

/**@}*/

/** @defgroup usb_otg_host_fs_hcintmsk6 FSHCINTMSK6 OTG_FS host channel-6 mask register (OTG_FS_HCINTMSK6)
@{*/

/** USB_OTG_HOST_FS_HCINTMSK6_DTERRM Data toggle error mask **/
#define USB_OTG_HOST_FS_HCINTMSK6_DTERRM		(1 << 10)
/** USB_OTG_HOST_FS_HCINTMSK6_FRMORM Frame overrun mask **/
#define USB_OTG_HOST_FS_HCINTMSK6_FRMORM		(1 << 9)
/** USB_OTG_HOST_FS_HCINTMSK6_BBERRM Babble error mask **/
#define USB_OTG_HOST_FS_HCINTMSK6_BBERRM		(1 << 8)
/** USB_OTG_HOST_FS_HCINTMSK6_TXERRM Transaction error mask **/
#define USB_OTG_HOST_FS_HCINTMSK6_TXERRM		(1 << 7)
/** USB_OTG_HOST_FS_HCINTMSK6_NYET response received interrupt mask **/
#define USB_OTG_HOST_FS_HCINTMSK6_NYET		(1 << 6)
/** USB_OTG_HOST_FS_HCINTMSK6_ACKM ACK response received/transmitted interrupt mask **/
#define USB_OTG_HOST_FS_HCINTMSK6_ACKM		(1 << 5)
/** USB_OTG_HOST_FS_HCINTMSK6_NAKM NAK response received interrupt mask **/
#define USB_OTG_HOST_FS_HCINTMSK6_NAKM		(1 << 4)
/** USB_OTG_HOST_FS_HCINTMSK6_STALLM STALL response received interrupt mask **/
#define USB_OTG_HOST_FS_HCINTMSK6_STALLM		(1 << 3)
/** USB_OTG_HOST_FS_HCINTMSK6_CHHM Channel halted mask **/
#define USB_OTG_HOST_FS_HCINTMSK6_CHHM		(1 << 1)
/** USB_OTG_HOST_FS_HCINTMSK6_XFRCM Transfer completed mask **/
#define USB_OTG_HOST_FS_HCINTMSK6_XFRCM		(1 << 0)

/**@}*/

