grevaillot/svd_tools/headers/STM32F105xx/usb_otg_host.h
/** @defgroup usb_otg_host_fs_hctsiz6 FSHCTSIZ6 OTG_FS host channel-6 transfer size register
@{*/


#define USB_OTG_HOST_FS_HCTSIZ6_DPID_SHIFT		29
#define USB_OTG_HOST_FS_HCTSIZ6_DPID_MASK		0x03
/** @defgroup usb_otg_host_fs_hctsiz6_dpid DPID Data PID
@{*/
/**@}*/


#define USB_OTG_HOST_FS_HCTSIZ6_PKTCNT_SHIFT		19
#define USB_OTG_HOST_FS_HCTSIZ6_PKTCNT_MASK		0x3ff
/** @defgroup usb_otg_host_fs_hctsiz6_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define USB_OTG_HOST_FS_HCTSIZ6_XFRSIZ_SHIFT		0
#define USB_OTG_HOST_FS_HCTSIZ6_XFRSIZ_MASK		0x7ffff
/** @defgroup usb_otg_host_fs_hctsiz6_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup usb_otg_host_fs_hcchar7 FSHCCHAR7 OTG_FS host channel-7 characteristics register (OTG_FS_HCCHAR7)
@{*/

/** USB_OTG_HOST_FS_HCCHAR7_CHENA Channel enable **/
#define USB_OTG_HOST_FS_HCCHAR7_CHENA		(1 << 31)
/** USB_OTG_HOST_FS_HCCHAR7_CHDIS Channel disable **/
#define USB_OTG_HOST_FS_HCCHAR7_CHDIS		(1 << 30)
/** USB_OTG_HOST_FS_HCCHAR7_ODDFRM Odd frame **/
#define USB_OTG_HOST_FS_HCCHAR7_ODDFRM		(1 << 29)

#define USB_OTG_HOST_FS_HCCHAR7_DAD_SHIFT		22
#define USB_OTG_HOST_FS_HCCHAR7_DAD_MASK		0x7f
/** @defgroup usb_otg_host_fs_hcchar7_dad DAD Device address
@{*/
/**@}*/


#define USB_OTG_HOST_FS_HCCHAR7_MCNT_SHIFT		20
#define USB_OTG_HOST_FS_HCCHAR7_MCNT_MASK		0x03
/** @defgroup usb_otg_host_fs_hcchar7_mcnt MCNT Multicount
@{*/
/**@}*/


#define USB_OTG_HOST_FS_HCCHAR7_EPTYP_SHIFT		18
#define USB_OTG_HOST_FS_HCCHAR7_EPTYP_MASK		0x03
/** @defgroup usb_otg_host_fs_hcchar7_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** USB_OTG_HOST_FS_HCCHAR7_LSDEV Low-speed device **/
#define USB_OTG_HOST_FS_HCCHAR7_LSDEV		(1 << 17)
/** USB_OTG_HOST_FS_HCCHAR7_EPDIR Endpoint direction **/
#define USB_OTG_HOST_FS_HCCHAR7_EPDIR		(1 << 15)

#define USB_OTG_HOST_FS_HCCHAR7_EPNUM_SHIFT		11
#define USB_OTG_HOST_FS_HCCHAR7_EPNUM_MASK		0x0f
/** @defgroup usb_otg_host_fs_hcchar7_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define USB_OTG_HOST_FS_HCCHAR7_MPSIZ_SHIFT		0
#define USB_OTG_HOST_FS_HCCHAR7_MPSIZ_MASK		0x7ff
/** @defgroup usb_otg_host_fs_hcchar7_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup usb_otg_host_fs_hcint7 FSHCINT7 OTG_FS host channel-7 interrupt register (OTG_FS_HCINT7)
@{*/

/** USB_OTG_HOST_FS_HCINT7_DTERR Data toggle error **/
#define USB_OTG_HOST_FS_HCINT7_DTERR		(1 << 10)
/** USB_OTG_HOST_FS_HCINT7_FRMOR Frame overrun **/
#define USB_OTG_HOST_FS_HCINT7_FRMOR		(1 << 9)
/** USB_OTG_HOST_FS_HCINT7_BBERR Babble error **/
#define USB_OTG_HOST_FS_HCINT7_BBERR		(1 << 8)
/** USB_OTG_HOST_FS_HCINT7_TXERR Transaction error **/
#define USB_OTG_HOST_FS_HCINT7_TXERR		(1 << 7)
/** USB_OTG_HOST_FS_HCINT7_ACK ACK response received/transmitted interrupt **/
#define USB_OTG_HOST_FS_HCINT7_ACK		(1 << 5)
/** USB_OTG_HOST_FS_HCINT7_NAK NAK response received interrupt **/
#define USB_OTG_HOST_FS_HCINT7_NAK		(1 << 4)
/** USB_OTG_HOST_FS_HCINT7_STALL STALL response received interrupt **/
#define USB_OTG_HOST_FS_HCINT7_STALL		(1 << 3)
/** USB_OTG_HOST_FS_HCINT7_CHH Channel halted **/
#define USB_OTG_HOST_FS_HCINT7_CHH		(1 << 1)
/** USB_OTG_HOST_FS_HCINT7_XFRC Transfer completed **/
#define USB_OTG_HOST_FS_HCINT7_XFRC		(1 << 0)

/**@}*/

/** @defgroup usb_otg_host_fs_hcintmsk7 FSHCINTMSK7 OTG_FS host channel-7 mask register (OTG_FS_HCINTMSK7)
@{*/

/** USB_OTG_HOST_FS_HCINTMSK7_DTERRM Data toggle error mask **/
#define USB_OTG_HOST_FS_HCINTMSK7_DTERRM		(1 << 10)
/** USB_OTG_HOST_FS_HCINTMSK7_FRMORM Frame overrun mask **/
#define USB_OTG_HOST_FS_HCINTMSK7_FRMORM		(1 << 9)
/** USB_OTG_HOST_FS_HCINTMSK7_BBERRM Babble error mask **/
#define USB_OTG_HOST_FS_HCINTMSK7_BBERRM		(1 << 8)
/** USB_OTG_HOST_FS_HCINTMSK7_TXERRM Transaction error mask **/
#define USB_OTG_HOST_FS_HCINTMSK7_TXERRM		(1 << 7)
/** USB_OTG_HOST_FS_HCINTMSK7_NYET response received interrupt mask **/
#define USB_OTG_HOST_FS_HCINTMSK7_NYET		(1 << 6)
/** USB_OTG_HOST_FS_HCINTMSK7_ACKM ACK response received/transmitted interrupt mask **/
#define USB_OTG_HOST_FS_HCINTMSK7_ACKM		(1 << 5)
/** USB_OTG_HOST_FS_HCINTMSK7_NAKM NAK response received interrupt mask **/
#define USB_OTG_HOST_FS_HCINTMSK7_NAKM		(1 << 4)
/** USB_OTG_HOST_FS_HCINTMSK7_STALLM STALL response received interrupt mask **/
#define USB_OTG_HOST_FS_HCINTMSK7_STALLM		(1 << 3)
/** USB_OTG_HOST_FS_HCINTMSK7_CHHM Channel halted mask **/
#define USB_OTG_HOST_FS_HCINTMSK7_CHHM		(1 << 1)
/** USB_OTG_HOST_FS_HCINTMSK7_XFRCM Transfer completed mask **/
#define USB_OTG_HOST_FS_HCINTMSK7_XFRCM		(1 << 0)

/**@}*/

/** @defgroup usb_otg_host_fs_hctsiz7 FSHCTSIZ7 OTG_FS host channel-7 transfer size register
@{*/


#define USB_OTG_HOST_FS_HCTSIZ7_DPID_SHIFT		29
#define USB_OTG_HOST_FS_HCTSIZ7_DPID_MASK		0x03
/** @defgroup usb_otg_host_fs_hctsiz7_dpid DPID Data PID
@{*/
/**@}*/


#define USB_OTG_HOST_FS_HCTSIZ7_PKTCNT_SHIFT		19
#define USB_OTG_HOST_FS_HCTSIZ7_PKTCNT_MASK		0x3ff
/** @defgroup usb_otg_host_fs_hctsiz7_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define USB_OTG_HOST_FS_HCTSIZ7_XFRSIZ_SHIFT		0
#define USB_OTG_HOST_FS_HCTSIZ7_XFRSIZ_MASK		0x7ffff
/** @defgroup usb_otg_host_fs_hctsiz7_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/
